# 6. В одномерном массиве найти сумму элементов, находящихся между минимальным и максимальным элементами.
# Сами минимальный и максимальный элементы в сумму не включать.

array = [64, 33, 96, 37, 38, 12, 45, 14, 47, 80, 49, 13, 79, 22, 25, 27, 93, 11]
_min = [array[0], 0]
_max = [array[0], 0]

for i, val in enumerate(array):
    if val < _min[0]:
        _min = [val, i]
    if val > _max[0]:
        _max = [val, i]

_sum = 0

for i in range(min(_min[1], _max[1]) + 1, max(_min[1], _max[1])):
    _sum += array[i]

print(f'Сумму элементов = {_sum}')